# Visualizing Data with Titanic DataSet

Before we start getting our hands dirty with the python and csv files, we first understand what is present in the dataset.

The dataset consists of the following columns:
1. PassengerId
2. Survived
3. Pclass
4. Name
5. Sex 
6. Age
7. SibSp
8. Parch
9. Ticket
10. Fare
11. Cabin
12. Embarked

<a id="top"></a> 
### Procedure followed throughout the project
1. [Importing Packages](#import)
2. [Data Inspection](#inspect)
    - [Dataset at a glance](#2.1)
    - [Columns at a glance](#2.2)
    - [To check whether data contains any null values](#2.3)
3. [Data Cleaning](#dcl)
    - [Dropping data column](#3.1)
    - [Populating the missing ages](#3.2)
    - [Missing embarkation ports](#3.3)
4. [Data Visualization](#visual)
5. [FAQs related to the DataSet](#faq)
    - [Which gender had a better chance of survival?](#5.1)
    - [Which social class had a better chance of survival?](#5.2)
    - [Which age group had a better chance of survival?](#5.3)
6. [Sugestion](#suggest)

<a id="import"></a>
## <u>1. Importing Python Packages</u>

Importing the required python packages for the project

In [89]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

<a id="inspect"></a>
## <u>2. Data inspection</u>

We perform the initial inspection by importing the required .csv file into the Jupyter notebook, looking into the file as we are not expected to remember all the details of the present in the file

<a id="2.1"></a>
### 2.1 Dataset at a glance

In [90]:
#reading and refering the data using the variable `data`
data = pd.read_csv("Titanic-DataSet.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

<a id="2.2"></a>
### 2.2 Columns at a glance

`variable.dtypes` prints the columns of the dataset along with the datatype in a tabular manner

In [91]:
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

<a id="2.3"></a>
### 2.3 To check whether data contains any null values

This step is crucial during the inspection stage, as this gives the analyst a rough idea of the number of data cells that needs to be filled with calculated values

In [92]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

#### Conclusion 

As we can see from the given table, columns like Age, Cabin and Embarked consists of null value which shall be either filled or dropped during the Data Cleaning Process.<br>

<a id="dcl"></a>
## <u>3. Data Cleaning</u>

One has to clean the data i.e., remove any null values and ambiguities (if any), and try to achieve uniformity in the dataset.

<a id="3.1"></a>
### 3.1 Dropping data column

Out of the 891 data entries, 687 data cells are empty in the dataset, so we can safely drop the column as it doesn't prove handy for us.

In [93]:
# By using the parameter inplace, we are indicating that this change shall be made permanent in our dataset. 
# Which by default is false 
data.drop('Cabin', axis=1, inplace=True)

We now print the columns of the dataset to check if `'cabin'` is dropped or not.

In [94]:
for i in data.columns:
    print(i)

PassengerId
Survived
Pclass
Name
Sex
Age
SibSp
Parch
Ticket
Fare
Embarked

<a id="3.2"></a>
### 3.2 Populating the missing ages

Here I plan to clean the data by filling in the **mean value of the age** in cell which have a NULL value

In [95]:
data['Age'].fillna(data['Age'].mean(), inplace=True)
data.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

<a id="3.3"></a>
### 3.3 Missing embarkation ports

We notice that the `Embarked` column contains some missing value. So we first find out the null entries

In [96]:
# data['Embarked'].isnull().sum()    { to check number of data entries with null value, turns out to be 2 }
missingports = data[data['Embarked'].isnull()]
missingports

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,NaN

We notice that both passengers were travelling with the same ticket number. And we would be filling the `Embarked` column with the mode of the column. For that, we will have to find the mode.

In [97]:
table = pd.crosstab(data['Embarked'],data['Sex'])
print(table)

Sex       female  male
Embarked
C             73    95
Q             36    41
S            203   441

From the above table we conclude that most women we travelling to **Southampton**. Hence we will be filling the NaN with S in both cases. And then recheck the null status of the Embarked column using `isnull().sum()`

In [98]:
data['Embarked'].fillna('S',inplace=True)

In [99]:
data['Embarked'].isnull().sum()

0

<a id="visual"></a> 
## <u>4. Data Visualization </u>

This section of the project consists of basic visualization of the dataset. The purpose of this section is for the better understanding of the dataset in a more clearer and visual manner.

<a id="faq"></a>
## <u>5. FAQs related to the DataSet</u>

<a id="5.1"></a>
### 5.1 Which gender had a better chance of survival?

<a id="5.2"></a>
### 5.2 Which social class had a better chance of survival?

<a id="5.3"></a>
### 5.3 Which age group had a better chance of survival?

<a id="suggest"></a>
### Suggestion
As with most datasets the more information we have the better it can be analysed. I believe that we could add the following variables:
- life boat number - the reason why there were so many fatalities on board the Titanic was due to there not been enough lifeboats. I believe that if we knew the lifeboat number and the capacity of a lifeboat we could determine if it was possible for more people to survive

[Back to Top](#top)